# slice의 step

list1 = list(range(20))
print(list1) #[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

# 5~15까지 전부
print(list1[5:15]) #[5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

# step
# 5~15까지 2개 건너 하나 : step 2
print(list1[5:15:2]) #[5, 7, 9, 11, 13]

# 5~15까지 3개 건너 하나 : step 3
print(list1[5:15:3])


# 음수 step
print(list1[5:15:-1]) #[]
print(list1[15:5:-1]) #[15, 14, 13, 12, 11, 10, 9, 8, 7, 6]
print(list1[14:4:-1]) #[14, 13, 12, 11, 10, 9, 8, 7, 6, 5]


print(list1[::3]) #[0, 3, 6, 9, 12, 15, 18]
print(list1[::-3]) #[19, 16, 13, 10, 7, 4, 1]


'''
Slice의 step

step
 - slice한 값의 범위에서 step 값을 주어 그 값만큼 건너뛰어 가져오는 기능
 - list[ 시작값:끝값:step ]
'''